<a href="https://colab.research.google.com/github/Sylwiaes/machine-learning-bootcamp/blob/main/supervised/01_basics/03_feature_extraction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### scikit-learn
Strona biblioteki: [https://scikit-learn.org](https://scikit-learn.org)  

Dokumentacja/User Guide: [https://scikit-learn.org/stable/user_guide.html](https://scikit-learn.org/stable/user_guide.html)

Podstawowa biblioteka do uczenia maszynowego w języku Python.

Aby zainstalować bibliotekę scikit-learn, użyj polecenia poniżej:
```
!pip install scikit-learn
```
Aby zaktualizować do najnowszej wersji bibliotekę scikit-learn, użyj polecenia poniżej:
```
!pip install --upgrade scikit-learn
```
Kurs stworzony w oparciu o wersję `0.22.1`

### Spis treści:
1. [Import bibliotek](#0)
2. [Załadowanie danych](#1)
3. [Utworzenie kopii danych](#2)
4. [Generowanie nowych zmiennych](#3)
5. [Dyskretyzacja zmiennej ciągłej](#4)
6. [Ekstrakcja cech](#5)

### <a name='0'></a> Import bibliotek

In [ ]:
import numpy as np
import pandas as pd
import sklearn

sklearn.__version__

'0.22.2.post1'

### <a name='1'></a> Załadowanie danych

In [ ]:
def fetch_financial_data(company='AMZN'): #Funkcja, która pozwala pobrać dane, ticker: "AMZN", który mozna znaleźć w dokumentacji pandas data reader
    """
    This function fetches stock market quotations.
    """
    import pandas_datareader.data as web
    return web.DataReader(name=company, data_source='stooq') #Źródło danych stooq

df_raw = fetch_financial_data() #Przypisanie fukcji do zmiennej df_raw
df_raw.head() #załadowanie 5 ostatnich danych dzięki metodzie head

                 Open     High        Low    Close   Volume
Date
2021-01-28  3235.0400  3301.68  3228.6900  3237.62  3149228
2021-01-27  3341.4900  3346.52  3207.0800  3232.58  4660158
2021-01-26  3296.3559  3338.00  3282.8700  3326.13  2955235
2021-01-25  3328.5000  3363.89  3243.1463  3294.00  3749758
2021-01-22  3304.3100  3321.91  3283.1644  3292.23  2821914

### <a name='2'></a> Utworzenie kopii danych

In [ ]:
df = df_raw.copy()
df = df[:5] #wycięcie 5 ostatnich wierszy
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5 entries, 2021-01-28 to 2021-01-22
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Open    5 non-null      float64
 1   High    5 non-null      float64
 2   Low     5 non-null      float64
 3   Close   5 non-null      float64
 4   Volume  5 non-null      int64
dtypes: float64(4), int64(1)
memory usage: 240.0 bytes

### <a name='3'></a> Generowanie nowych zmiennych

In [ ]:
df.index.month #funkcja, która pozwala na podzielenie danych wg jakiejś konkretnej cechy, np. month, day, year

Int64Index([1, 1, 1, 1, 1], dtype='int64', name='Date')

In [ ]:
df['day'] = df.index.day
df['month'] = df.index.month
df['year'] = df.index.year
df

                 Open     High        Low    Close   Volume  day  month  year
Date
2021-01-28  3235.0400  3301.68  3228.6900  3237.62  3149228   28      1  2021
2021-01-27  3341.4900  3346.52  3207.0800  3232.58  4660158   27      1  2021
2021-01-26  3296.3559  3338.00  3282.8700  3326.13  2955235   26      1  2021
2021-01-25  3328.5000  3363.89  3243.1463  3294.00  3749758   25      1  2021
2021-01-22  3304.3100  3321.91  3283.1644  3292.23  2821914   22      1  2021

### <a name='4'></a> Dyskretyzacja zmiennej ciągłej

In [ ]:
df = pd.DataFrame(data={'height': [175., 178.5, 185., 191., 184.5, 183., 168.]})
df

   height
0   175.0
1   178.5
2   185.0
3   191.0
4   184.5
5   183.0
6   168.0

In [ ]:
df['height_cat'] = pd.cut(x=df.height, bins=3) #metoda, w której zmieniamy zmienną ciągłą na zmienną kategoryczną; bins oznacza ilość podziałów zmiennej  
df

   height          height_cat
0   175.0  (167.977, 175.667]
1   178.5  (175.667, 183.333]
2   185.0    (183.333, 191.0]
3   191.0    (183.333, 191.0]
4   184.5    (183.333, 191.0]
5   183.0  (175.667, 183.333]
6   168.0  (167.977, 175.667]

In [ ]:
df['height_cat'] = pd.cut(x=df.height, bins=(160, 175, 180, 195)) #przedstawiamy konkretne dane w tuplach, które chcemy użyć jako przedziały
df

   height  height_cat
0   175.0  (160, 175]
1   178.5  (175, 180]
2   185.0  (180, 195]
3   191.0  (180, 195]
4   184.5  (180, 195]
5   183.0  (180, 195]
6   168.0  (160, 175]

In [ ]:
df['height_cat'] = pd.cut(x=df.height, bins=(160, 175, 180, 195), labels=['small', 'medium', 'high']) #wyświetlenie etykiety przy pomocy metody labels
df

   height height_cat
0   175.0      small
1   178.5     medium
2   185.0       high
3   191.0       high
4   184.5       high
5   183.0       high
6   168.0      small

In [ ]:
pd.get_dummies(df, drop_first=True, prefix='height') #metoda get_dummies pozwala na przygotowanie modelu do uczenia i przyporzadkowanie danych 0,1; 
#parametr drop_first usunie niepotrzebną kolumnę dla height n-1

   height  height_medium  height_high
0   175.0              0            0
1   178.5              1            0
2   185.0              0            1
3   191.0              0            1
4   184.5              0            1
5   183.0              0            1
6   168.0              0            0

### <a name='5'></a> Ekstrakcja cech

In [ ]:
df = pd.DataFrame(data={'lang': [['PL', 'ENG'], ['GER', 'ENG', 'PL', 'FRA'], ['RUS']]}) #ekstrakcja cech z językami w aplikacji
df

                  lang
0            [PL, ENG]
1  [GER, ENG, PL, FRA]
2                [RUS]

In [ ]:
df['lang_number'] = df['lang'].apply(len) #Apply(len)zmienna opisująca liczbę elementów dla każdej z tych list; lang number okresla jak długa jest ta lista
df

                  lang  lang_number
0            [PL, ENG]            2
1  [GER, ENG, PL, FRA]            4
2                [RUS]            1

In [ ]:
df['PL_flag'] = df['lang'].apply(lambda x: 1 if 'PL' in x else 0) #Funkcja lambda, która zwraca 1 jeśli zbiorze jest PL, w przeciwnym wypadku zwraca nam 0
df

                  lang  lang_number  PL_flag
0            [PL, ENG]            2        1
1  [GER, ENG, PL, FRA]            4        1
2                [RUS]            1        0

In [ ]:
df = pd.DataFrame(data={'website': ['wp.pl', 'onet.pl', 'google.com']}) #stworzenie DF dla stringów
df

      website
0       wp.pl
1     onet.pl
2  google.com

In [ ]:
df.website.str.split('.', expand=True) #Funkcja split dzieli dany tekst względem kropki; przekazując parametr expand na wartość True, budujemy 2 nowe kolumny

        0    1
0      wp   pl
1    onet   pl
2  google  com

In [ ]:
new = df.website.str.split('.', expand=True) #Tworzymy zmienną new i przypisujemy do niej powyższy parametr i jako nowa zmienna - kolumna przypisujemy dane
#portal i extension
df['portal'] = new[0]
df['extension'] = new[1]
df

      website  portal extension
0       wp.pl      wp        pl
1     onet.pl    onet        pl
2  google.com  google       com